<template>
    <div class="block top-padded">
        <h4>Настройки корректировки стоимости доставки</h4>
        <p>Для расчёта наценок, скидок или фиксированной стоимости доставки можно использовать формулы. Если указать просто
            число, то это будет считаться фиксированной стоимостью. Также можно указать формулу, чтобы считать
            какую-то наценку или вычислять стоимость доставки исходя из стоимости заказа. Доступные переменные:</p>
        <ul class="no-list-item">
            <li><var>S</var> — рассчитанная сервером {{ carrier }} стоимость доставки</li>
            <li><var>Z</var> — стоимость заказа с учётом скидок</li>
            <li><var>W</var> — стоимость заказа без учёта скидок</li>
        </ul>
        <p>Вот несколько наиболее частых примеров формул:</p>
        <ul class="no-list-item">
            <li><code>S+S*0.1</code> — увеличить рассчитанную стоимость доставки на 10%</li>
            <li><code>S+(S+Z)*0.04</code> — добавить 4% от суммы доставки и заказа (если нужно учесть расходы на наложенный платёж например)</li>
            <li><code>S+150</code> — добавить 150₽ к рассчитанной стоимости заказа (если нужно учесть расходы на упаковочные материалы)</li>
        </ul>
    </div>
</template>

<script>
    export default {
        name: "AboutSurcharge",
        props: {
            carrier: { type: String, default: ''}
        }
    }
</script>

<style lang="stylus" scoped>
    ul.no-list-item
        list-style-type none
        line-height 1.3

</style>