<template>
    <div class="block top-padded">
        <h4>Запрет расчёта доставки в города и регионы</h4>
        <p>В поле с правилом запрета доставки можно указывать названия городов, регионов в которые не нужно производить
            расчёт. Значения отделяются друг от друга точкой с запятой. Чтобы указать город просто напишите его назвние
            (например «вологда»), чтобу указать целый регион укажите его код после двоеточия (например «:47»), чтобы указать
            город в конкретном регионе укажите его название и регион через двоеточие (например «одинцово:50»)</p>
        <p>Пример правила «<code>вологда;:47;одинцово:50</code>» запретит расчёт в любой город с названием «вологда»,
            во всю Ленинградскую область и в город «одинцово» Московской области</p>
        <p>Таже можно сделать зеркальное правило, если выбрать тип <i><b>кроме</b></i>: тогда доставка наоборот будет
            разрешена только в те города и регионы, которые указаны в правиле.</p>
    </div>
</template>

<script>
    export default {
        name: "AboutCityExclusion"
    }
</script>
